tutorials/preProcessing/PDRsetFields/simplePipeCage/0.orig/b
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      b;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    outer
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground
    {
        type            zeroGradient;
    }

    blockedFaces
    {
        type            zeroGradient;
    }

    mergingFaces
    {
        type            zeroGradient;
    }

    wallFaces
    {
        type            zeroGradient;
    }

    ySymmetry
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
